arokiasamy 2
joseph 6
v 259
singapore 195
airlines 33
staff 8
union 27
[ 364
2000 283
] 363
sgca 18
15 43
case 355
number 70
: 790
ca 44
132/1999 1
decision 219
date 76
22 62
march 65
tribunal/court 18
court 587
of 5598
appeal 372
coram 18
chao 18
hick 18
tin 18
ja 39
; 268
l 17
p 86
thean 22
yong 8
pung 5
how 52
cj 6
counsel 112
name 117
( 1459
s 963
) 1458
suresh 1
damodara 1
and 2813
john 8
thomas 5
colin 1
ng 1
& 193
partners 9
for 1154
the 13110
respondents 378
parties 176
— 18
administrative 10
law 148
– 319
dismissal 19
from 547
employment 18
natural 27
justice 58
not 1188
to 4362
refer 48
matter 139
industrial 22
arbitration 134
whether 267
acted 24
in 2934
breach 94
unfair 16
trade 80
constitution 14
imposes 1
obligation 35
on 1264
represent 12
its 204
members 58
whenever 7
requested 15
referral 3
jurisdictional 7
requirements 15
dispute 73
over 62
between 172
employer 52
employee 14
could 229
be 1009
heard 45
by 1045
delivering 31
judgment 170
introduction 5
appellant 651
brought 56
this 671
against 215
warren 3
lh 3
khoo 4
j 60
who 162
dismissed 66
` 2326
application 156
a 2259
declaration 20
an 752
injunction 59
compel 5
his 513
former 8
employers 10
, 4982
ltd 210
concerning 16
termination 99
iac 31
. 4308
background 13
facts 72
had 691
been 306
1973 10
until 59
he 717
was 1970
organisation 1
1997. 21
1989 9
1995 22
seconded 1
siasu 69
during 35
that 2590
time 241
held 171
various 41
positions 2
such 280
as 1073
assistant 20
general 53
secretary 32
chairman 14
marketing 19
division 4
disciplinary 100
committee 223
sports 1
sometime 16
1996 16
came 48
under 381
investigation 14
corrupt 1
practices 4
bureau 2
result 49
voluntarily 2
resigned 2
posts 2
but 219
retained 10
ordinary 32
membership 3
18 18
february 71
1997 81
charged 16
with 638
offences 12
subordinate 3
courts 15
accused 70
obtaining 10
bribes 1
form 53
loans 10
three 92
were 640
facing 6
inquiries 2
unable 29
raise 11
bail 3
amount 51
$ 188
20,000 1
remanded 1
queenstown 1
remand 2
prison 1
till 2
trial 143
while 55
received 45
letter 68
dated 37
5 46
relevant 56
portion 16
which 660
reads 10
dear 1
mr 44
clement 1
you 88
have 414
reported 15
work 47
since 49
21 58
nor 29
given 121
company 178
any 391
reason 73
your 43
unauthorised 4
absence 17
therefore 87
broken 6
contract 192
service 18
is 1117
terminated 23
version 237
no 592
0 236
mar 94
00:00 235
hrs 235
effect 41
last 19
day 36
20 46
2 174
consequent 3
will 118
paid 82
salary 5
up 86
including 18
... 151
subsequently 31
acquitted 1
charges 40
after 156
june 28
then 189
sought 50
reinstatement 7
writing 16
letters 44
people 5
throughout 4
months 33
july 42
31 29
met 24
representatives 9
discuss 9
compensation 4
package 3
lieu 1
some 129
also 232
present 78
at 703
meeting 99
however 118
agreement 488
reached 26
took 82
out 201
dc 1
suit 45
4989/97 1
november 21
claiming 14
damages 57
alleged 75
wrongful 24
may 177
1998 118
instructed 11
solicitors 50
discontinue 1
action 108
around 20
discontinued 2
wrote 21
two 246
president 8
requesting 3
them 144
file 20
behalf 38
ss 23
35 20
1 213
82 18
relations 9
act 225
cap 54
shy 1
136 1
ira 26
adjudicate 1
him 213
said 230
there 478
other 220
grounds 52
before 198
these 169
included 14
fact 132
treated 15
fairly 8
impartially 4
singled 1
victimised 2
engaging 2
labour 6
terms 94
violation 3
accorded 3
fair 17
impartial 2
hearing 48
misconduct 17
accordance 32
express 15
implied 46
collective 5
reply 19
first 194
26 18
1998. 18
september 47
executive 18
council 74
considered 41
response 10
second 123
11 88
august 71
following 96
re 16
we 409
above 57
deliberated 3
length 7
order 183
support 25
s35 1
must 147
able 25
show 31
due 63
reasons 37
stated 54
based 39
evidence 187
are 261
our 108
view 88
regret 1
accede 4
request 24
wish 10
all 235
best 7
endeavours 2
applied 58
pursuant 55
below 70
claimed 27
bring 22
virtue 11
art 11
3.2 9
iii 27
gave 55
rise 21
contractual 26
rights 25
obligations 27
failing 21
breached 16
furthermore 30
contravention 9
rules 52
opportunity 21
made 260
felt 30
fit 10
being 99
judge 266
opinion 62
3 112
only 212
sets 3
generality 1
objects 7
purposes 15
did 292
give 67
individual 8
member 43
enforceable 7
compulsive 1
powers 23
rejected 15
arguments 12
improperly 5
refusing 12
intercede 5
event 29
wording 6
indicated 16
discretion 19
decide 16
take 56
shown 29
within 87
provided 57
jurisdiction 73
commenting 2
obviously 21
fall 16
provisions 45
31. 2
far 35
concerned 55
caught 3
limitation 12
1a 3
consider 35
relating 34
circumstances 92
arising 28
situations 6
dismissals 1
employees 8
connection 23
activities 6
arise 21
concluded 12
make 89
prima 25
facie 30
one 242
substance 21
claim 114
giving 15
representations 5
required 63
thus 83
costs 74
fixed 19
500 1
appealed 24
whole 31
appeared 14
person 90
submitted 37
firstly 8
himself 28
forming 3
every 14
secondly 19
defined 12
same 120
should 204
granted 71
fell 16
finally 19
they 276
never 21
coming 5
their 215
pursue 5
ground 112
contractually 6
obliged 10
pays 2
certain 46
subscription 6
each 70
month 14
indication 7
relationship 26
found 83
article 33
relied 39
contention 23
section 60
titled 1
shall 110
and/or 34
persons 28
necessary 70
or 772
desirable 6
interest 68
words 80
used 56
along 11
normal 6
practice 18
making 22
impose 4
puts 1
because 99
main 33
joining 2
ensure 12
welfare 2
looked 7
so 173
discriminated 1
unfairly 6
does 80
accordingly 47
when 167
put 37
it 988
well 61
exists 4
correct 22
hold 28
term 52
capable 6
enforced 9
principal 5
regulate 3
provision 30
comes 3
include 6
inter 33
alia 32
fostering 1
sense 22
involvement 8
identity 7
amongst 6
co-operating 1
striving 1
success 16
benefiting 1
through 34
equitable 13
sharing 1
fruits 1
promote 10
educational 2
cultural 1
vocational 1
recreational 1
social 2
material 47
interests 16
argued 20
read 25
context 18
would 465
interpret 3
drafters 2
intend 5
officials 1
matters 64
added 32
has 220
interceding 1
cases 55
involving 10
whose 12
services 27
bound 15
hear 22
can 139
agree 39
mandatory 8
attention 9
reasonable 55
interpretation 8
indicates 4
built 3
into 184
simply 5
past 4
where 131
chosen 5
active 2
role 11
seeking 24
mean 21
do 130
protect 9
quite 28
appropriate 18
just 41
likely 16
feel 6
saying 15
custom 5
insufficient 3
establish 16
obligated 1
particular 32
adequate 8
existence 14
rule 35
assess 5
if 248
entire 22
scope 32
think 70
succeed 8
amounts 22
meets 1
states 15
cognizance 6
described 13
likewise 3
pertaining 5
connected 8
non-employment 1
transfer 71
conditions 35
entitled 68
those 87
serves 1
purpose 46
essentially 7
asking 8
procure 5
even 72
though 35
broadly 1
alone 14
pointless 2
unless 40
listed 17
unions 1
jointly 22
registrar 21
b 83
party 108
makes 9
50 11
91 2
c 44
d 30
minister 11
notice 101
gazette 2
directs 4
e 11
proclamation 1
declares 1
special 29
essential 10
public 63
more 86
importantly 4
acts 23
restriction 8
portions 4
award 166
except 21
notwithstanding 10
subsection 5
considers 4
without 67
cause 54
excuse 4
than 78
reinstated 2
deals 1
injuring 3
account 65
dismiss 9
threaten 4
injure 2
alter 5
position 53
prejudice 21
circumstance 3
proposes 3
become 15
officer 27
association 8
registered 34
benefit 19
appear 19
witness 14
proceedings 98
improve 1
working 22
dissatisfied 7
served 7
17 35
negotiations 10
notified 7
part 154
f 4
absented 4
leave 107
carrying 13
duties 11
exercising 8
81 1
unreasonably 5
deferred 1
withheld 3
g 4
panel 7
appointed 42
6 66
performing 2
functions 9
declared 6
falling 6
directed 13
ie 15
restrictions 4
imposed 13
basis 46
affidavit 23
falls 6
82. 2
i 515
recently 5
official 18
defendants 44
better 9
sia 19
namely 59
passenger 2
department 10
auld 4
cargo 1
route 3
revenue 2
departments 2
invite 2
negotiate 3
new 43
problem 6
submissions 9
issue 91
expressly 20
sub-ss 4
absent 4
clearly 61
face 21
sent 16
personnel 2
manager 9
actual 10
events 11
place 37
crucially 1
deny 8
authorisation 3
long 26
decided 50
terminate 27
situation 16
apply 42
ask 11
about 119
limit 23
substantive 4
ought 26
ordered 31
manpower 2
breaches 34
final 27
addressed 10
manner 22
done 41
further 99
aware 22
sections 7
bad 3
faith 9
ultra 4
vires 4
arriving 4
involved 17
consideration 30
questions 32
erred 9
taking 30
wrong 20
asked 65
null 3
void 17
minutes 46
meetings 8
seek 6
legal 33
advice 4
presumably 10
replied 9
informing 3
discussed 16
commented 2
know 34
longer 14
reiterated 5
find 53
contravened 3
say 44
related 13
sufficiently 7
correctly 7
conclusion 49
purview 2
placed 43
very 61
strained 2
comment 4
knowing 5
realistic 2
argument 32
interpreted 5
misconceived 2
come 27
deciding 7
sympathise 1
somewhat 2
lost 10
job 22
declarations 1
arrangements 1
proper 19
whom 17
redress 1
feels 1
premises 15
taxed 1
usual 8
consequential 7
security 28
deposit 9
released 4
outcome 22
copyright 26
© 18
government 23
hong 14
huat 4
development 21
co 67
pte 117
hiap 2
14 53
85/1999 1
tan 268
lee 111
meng 47
lawrence 1
teh 6
rodyk 8
davidson 10
appellants 424
chung 2
sharon 2
tay 29
donaldson 4
burkinshaw 3
28 75
refusal 12
grant 69
applying 5
point 79
begins 2
run 16
publication 15
extension 33
principles 16
applicable 14
-reasons 1
delay 50
prospects 3
standard 17
substantial 21
affected 14
7 31
10 47
1985 14
ed 40
o 26
69 12
rr 1
4 53
rev 16
setting 11
aside 62
arbitrator 89
prolonged 4
deficiencies 1
reasoning 10
building 28
contracts 8
's 6
duty 35
discharge 27
architect 59
certification 11
nature 35
extent 31
premised 3
knowledge 18
default 17
phrases 5
`` 84
substantially 17
affect 10
'' 100
published 13
r 33
high 86
filing 9
set 101
issues 52
largely 5
undisputed 2
owners 2
six-storey 1
shopping 10
centre 23
situated 4
upper 4
serangoon 1
road 16
contractors 12
works 14
commenced 21
1979 12
written 36
27 11
january 37
price 58
10,243,091.26 1
incorporated 16
institute 5
architects 5
clause 44
34 8
provides 37
reference 58
course 43
project 38
disputes 13
arose 13
recoverable 5
certificate 31
delayed 4
issuance 3
honouring 6
interim 65
certificates 59
cl 85
30 40
excessive 1
deductions 2
retention 8
sums 28
late 23
release 21
upon 93
practical 6
completion 13
expiration 4
defects 5
liability 7
period 60
referred 72
raymond 3
kuah 1
nominated 3
accepted 27
appointment 18
october 38
1986. 1
completed 14
1988. 1
nothing 48
despite 7
several 22
requests 10
years 52
later 65
1990 11
quantity 9
surveyor 7
assist 6
aspects 4
valuation 5
agreed 110
29 27
1993 49
stating 12
accounts 13
consequently 8
publish 1
beginning 3
latest 2
unfortunately 2
five 22
reminders 3
eventually 15
24 7
december 42
delivered 14
either 31
payment 94
balance 19
fees 10
amounting 9
47,516 1
discussions 4
ensued 1
share 29
equally 11
8 80
1999 104
own 38
obtained 21
forwarded 7
copy 16
favour 26
granting 10
reliefs 7
subject 59
reduction 1
adjudicated 2
sum 62
351,642.06 1
awarded 20
397,788.78 1
losses 8
suffered 26
holding 27
liable 21
promptly 2
issuing 9
indeed 21
engagement 2
involves 6
procedure 23
exercise 43
according 25
things 28
enable 18
contractor 26
carry 15
power 28
certify 5
payments 13
neutral 2
1,799.70 2
issued 31
allowed 54
greater 6
deducted 8
money 60
permissible 4
26,351.40 2
failure 49
moiety 1
total 16
residue 1
prescribed 13
third 54
176,210.50 1
end 25
respect 108
% 65
per 20
annum 1
commencement 9
determination 25
certifying 7
9 29
april 39
filed 27
originating 13
motion 22
employer-appellants 1
contended 37
question 172
widely 4
construction 34
industry 3
here 45
resolution 26
commercial 6
certainty 4
alternative 9
remedy 14
prayed 6
inordinate 5
demonstrated 7
incapable 5
conducting 4
competent 7
expeditious 2
seriously 6
prejudicial 6
refuted 1
learned 146
appears 10
deal 32
principally 3
factors 9
enunciated 5
chen 4
chien 2
wen 2
edwin 2
pearson 5
1991 11
slr 66
212 1
mlj 25
208 1
- 64
chances 2
succeeding 1
degree 6
factor 12
too 29
frame 9
days 52
good 19
clear 74
albeit 3
findings 11
thereupon 4
rare 2
addition 13
themselves 18
failed 39
honour 12
specified 12
strong 9
observed 5
much 44
refused 27
challenged 7
canvassed 10
us 105
heads 2
what 154
err 1
implicitly 7
fourth 11
nevertheless 15
preliminary 20
objection 18
raised 58
lie 6
gives 6
importance 6
applies 14
england 10
prior 18
6a 2
1981 18
latter 37
type 9
adopted 18
english 30
nema 4
btp 2
tioxide 2
pioneer 2
shipping 4
1980 5
qb 12
547 2
564 2
rio 2
sun 3
italmare 1
ocean 1
tanker 1
inc 9
1982 4
er 28
517 1
wlr 12
158 1
pertinent 12
consent 20
itself 23
provide 34
entered 43
subsequent 17
anything 17
way 47
uses 1
phrase 7
permissive 1
53 6
convenient 4
speed 2
short 11
evaluation 1
determine 16
adverse 10
impossible 7
meet 12
deadline 3
cited 10
mebro 3
oil 5
sa 11
gatoil 1
international 11
lloyd 8
rep 4
235. 1
rested 2
amended 15
73 2
supreme 12
operation 10
1983 4
distinct 14
procedures 2
applications 19
appeals 45
really 28
assistance 10
now 71
prevailing 2
bingham 3
observations 7
previous 14
certainly 8
germane 4
plain 8
both 96
single 11
showed 14
intention 26
challenges 1
arbitral 7
awards 3
doubt 26
stage 21
almost 8
entirely 13
academic 3
combined 1
document 2
thereby 11
saving 2
additional 32
fee 11
undoubtedly 4
obvious 11
sensible 6
emphasis 23
real 15
conceptually 2
see 79
probably 7
rather 13
expedient 1
solution 5
permitting 4
inclusion 1
otherwise 28
steps 11
ineffectual 1
passing 24
mention 22
asserted 5
allows 2
option 5
doing 17
back 52
little 5
next 37
concerns 15
brooke 6
mitchell 5
1840 1
lj 27
ex 27
269 2
ready 5
collection 4
urged 3
follow 12
occurred 5
contents 18
stand 10
authority 34
baron 4
alderson 3
parties. 1
archipelagos 3
delfi 3
bulk 3
transport 2
corp 9
sissy 1
steamship 1
289 1
reaffirmed 2
established 27
misunderstanding 1
accept 31
line 15
attempt 7
discredit 1
accuracy 3
reports 15
parker 3
comprehensively 1
reviewed 5
difficulties 5
stronger 2
dictum 4
quoted 11
editorial 1
error 9
overthrow 1
world 8
140 1
years. 1
worthwhile 1
noting 1
another 76
report 40
journal 1
statute 14
means 11
settled 15
acquainted 2
move 7
parke 1
affirmed 17
formulation 1
word 22
satisfied 29
reach 5
expenses. 1
indicate 14
unanimous 1
consistent 17
earlier 50
authorities 20
musselbrook 1
dunkin 1
1833 2
bing 1
605 1
131 3
741 1
macarthur 1
campbell 1
ad 5
110 2
882 2
extending 2
exorbitant 2
kind 11
drag 1
litigation 16
unnecessarily 2
adopting 5
challenge 13
rigid 1
different 36
away 17
might 47
incapacitated 2
preferred 7
ensures 2
prompt 1
depend 10
inconsistent 11
legislative 2
policy 8
underlying 5
arbitrated 1
need 32
finality 9
extenuating 1
exist 6
liberty 8
meritorious 2
governing 5
regarded 10
supra 25
traditional 2
guidelines 5
mortgage 5
sandoes 2
ors 20
tlr 2
751. 1
bear 13
mind 47
plaintiffs 48
professional 18
negligence 6
exchange 16
statements 59
expert 6
neither 18
direction 9
opening 9
remarks 2
millett 2
encapsulated 2
why 42
mutual 5
serve 3
fault 3
penalised 1
? 62
approved 5
master 3
rolls 2
vice-chancellor 1
adopt 7
dealing 19
relate 7
notices 7
frames 2
interlocutory 11
attended 2
tokai 1
maru 1
105 1
recognised 12
stringent 1
approach 19
compared 5
extend 12
distinguish 9
merits 4
entail 1
rehearing 1
factual 4
relief 33
complete 13
substitution 3
remit 4
decisions 9
ones 4
lack 12
expertise 5
adjudication 2
extensions 2
overriding 1
principle 30
always 12
attainment 3
observe 8
thought 25
content 2
knew 25
having 71
taken 73
regard 23
complain 6
ruled 10
recourse 4
28. 6
relation 60
critical 3
spelt 3
hobhouse 1
petroleum 5
refining 1
supply 18
sdad 1
elpis 1
finance 8
408 1
follows 51
unfettered 1
exercised 10
many 7
relatively 5
liberal 1
system 2
carefully 6
controlled 7
limits 10
entertain 4
range 6
arbitrators 5
misconducted 1
describe 5
technical 2
procedural 8
mishap 1
viewed 7
fundamental 5
tribunal 12
interfere 6
becomes 9
effectively 9
ways 2
wishes 5
choice 9
opposite 3
borne 10
obtain 14
originally 7
logic 3
bearing 21
parliament 4
enacting 1
right 71
object 13
freely 3
light 33
discussion 7
ran 9
got 7
time-limit 1
passed 29
turn 34
identified 9
receipt 23
demanded 4
initially 4
paying 13
one-half 1
settlement 61
averred 3
informed 31
bringing 11
extended 12
denial 2
affidavits 6
representation 22
ong 7
leng 4
sau 1
poo 2
137 1
proceed 11
satisfactorily 3
pay 54
full 34
pick 2
wondered 1
talk 4
unknown 1
unusual 1
avoid 5
uncertainties 1
overdue 1
sue 6
whatever 8
defences 7
available 34
grossly 3
picked 6
reverse 1
known 41
less 28
likelihood 2
again 32
seen 10
settlements 6
on-going 1
infer 2
understanding 10
begin 4
going 13
win 2
lose 6
implicit 5
once 12
reckoning 1
1999. 15
seem 2
magnitude 2
ten 22
ago 3
handling 2
needed 3
review 10
consultation 1
seems 29
prospect 1
se 4
american 1
home 15
assurance 4
lam 2
marine 2
682 1
traced 1
laid 17
down 29
house 38
lords 11
ac 31
724 1
antaios 2
compania 1
naviera 1
salen 1
rederierna 1
ab 1
191 1
uk 3
equivalent 23
nema/antaios 1
consistently 4
differently 3
arises 5
one-off 2
strictly 6
normally 5
relates 10
strict 3
cumulative 2
add 12
significantly 1
clarity 1
comprehensiveness 1
gone 5
diligently 1
unqualified 1
identifiable 1
go 31
para 39
thereof 24
certifier/architect 1
discharging 4
properly 14
replace 1
vol 2
emden 2
8th 3
agent 11
wrongly 2
withholds 1
approval 11
992 1
item 8
ii 28
dicta 2
scott 1
frederick 2
leyland 2
panamena 3
europea 2
navigacion 2
cia 2
1943 2
76 2
li 2
113 4
124. 1
admittedly 3
infrequency 1
detract 1
existed 4
instant 9
applicants 7
prevent 17
repeated 9
delays 4
proposition 6
amply 4
supported 5
lr 5
perini 1
commonwealth 2
australia 2
1969 1
12 104
blr 1
pre-requisite 1
complies 1
eg 1
hudson 13
engineering 7
keating 1
rationale 3
employed 3
certifier 1
function 2
among 13
others 14
independently 3
unreasonable 15
expect 3
lay 11
warrant 15
performance 39
establishing 5
lubenham 3
fidelities 1
investments 12
south 1
pembrokeshire 1
district 4
anor 25
1986 8
33 17
build 5
39 3
58. 1
wide 12
architect. 1
conceivably 2
specifically 18
foregoing 3
ignores 1
formulated 2
render 11
sentences 1
followed 16
immediately 21
passage 11
41 26
hard 2
possibly 6
acquiesced 6
claimants 1
pattern 3
seemingly 1
inexcusable 1
open 14
counter 8
finding 21
wrongfully 12
certified 10
mere 23
necessarily 12
imply 5
although 37
separate 43
correspondence 10
suggest 12
attributable 1
improper 5
submission 22
claims 10
resulting 12
least 13
advisers 1
58 2
contained 27
permitted 16
currency 4
implication 4
common 32
simple 5
needing 1
corrected 3
like 25
briefly 9
denning 1
expression 9
meant 16
minor 3
point. 1
respondent 216
four 28
397,788 2
176,210.00 1
encompassed 1
plus 8
reduced 6
kept 11
constitute 13
irreparable 1
harm 1
continues 1
outstanding 19
preparation 7
contribute 12
solely 10
patience 2
hoping 2
perhaps 10
fear 4
save 5
start 8
square 1
waited 3
went 58
views 14
thing 8
directions 1
conduct 31
thinks 2
aforesaid 10
remitted 2
reconsideration 2
together 27
prayers 1
constituted 12
examination 7
highly 9
unprofitable 1
incurred 7
prejudiced 5
regards 8
broad 6
advanced 12
substantiate 2
rendering 3
callous 1
deficient 2
imposition 2
pa 2
twelve 2
counterclaim 13
touch 5
despatch 1
tolerated 1
deplore 1
undermine 3
removed 6
18. 2
instance 20
strongly 1
enough 12
step 6
mainly 3
send 4
rendered 13
smacks 1
turning 11
adequately 5
dealt 20
raising 8
side 5
allow 18
errors 2
record 7
use 71
unjustified 2
over-certified 1
repayment 3
perusal 1
shows 3
aspect 8
pleaded 21
defence 72
merit 8
note 17
actions 10
hand 42
permit 9
hereby 8
mentioned 20
55 2
deemed 6
succeeded 9
points 8
two-thirds 1
herein 11
refunded 4
ching 8
mun 4
fong 7
executrix 8
estate 110
geok 4
tee 5
deceased 183
liu 60
cho 5
chit 5
111/1999 1
112/1999 1
michael 3
sc 10
josephine 1
low 11
jimmy 3
yap 2
harpal 3
singh 12
ee-von 1
wong 19
m 4
seow 5
civil 10
pleadings 11
amending 2
statement 71
amendment 27
res 22
judicata 22
doctrine 45
true 42
precluded 7
non-party 1
abuse 40
process 42
trusts 14
constructive 25
remedies 7
restitution 3
trust 49
frivolous 7
vexatious 7
111/99 1
dismissing 5
struck 8
112/99 1
disallowed 3
amend 9
her 208
widow 6
sues 2
capacity 24
wake 1
93 2
94/97 8
fook 15
gee 16
121 10
suits 7
tried 27
4141/83 3
kong 33
642,451.04 15
loan 7
93/97 3
4149/84 6
plaintiff 82
wife 25
lim 52
siam 1
soi 1
she 222
sued 6
tat 14
died 3
represented 5
kai 11
collin 17
daughter 6
property 71
lot 22
1606 11
mukim 3
area 15
approximately 6
acres 7
equal 6
shares 223
alternatively 7
631,579.10 1
1,800,000 1
representing 8
jan 45
purchase 36
2,431,579.10 2
led 9
fully 14
1972 4
called 34
peng 9
ann 5
realty 2
purchased 4
large 11
parcel 1
land 33
situate 1
kampong 1
chai 14
chee 4
comprising 7
lots 11
21-26 6
4-4 2
407 2
120 1
122 6
123 7
221 3
186.7 1
shareholder 26
managing 8
director 44
1,090,000 1
sale 83
scheduled 5
1972. 1
5.8 1
gazetted 1
acquisition 4
neighbouring 3
lands 1
notification 4
co-directors 1
apprehensive 1
bought 3
sell 54
remaining 27
introduced 12
23 64
investment 18
whereby 4
178 1
2,050,000 1
family 41
companies 35
orally 4
develop 2
containing 9
4.6 1
zoned 2
permanently 1
residential 3
joint 52
venture 18
site 14
names 9
embodied 1
agreements 22
collectively 2
sub-sale 5
sold 39
50,000 5
condition 11
purchasers 3
vendor 3
subdivision 1
delineate 1
separately 6
remainder 1
expenses 36
signed 37
respectively 21
pre-incorporation 3
incorporation 3
collden 6
authorised 9
capital 26
2m 12
similarly 10
expressed 19
convey 6
return 27
credited 6
allotted 4
anyone 7
backdated 1
executed 8
nominees 3
father 15
husband 3
conveyed 4
1976 5
4.2 1
acquired 21
2,500,000 1
unacquired 2
comprised 2
3.7 1
21,808 1
sq 2
ft 2
adjoining 1
rural 1
resurveyed 1
resurvey 1
transpired 2
materialise 1
respective 11
implement 2
original 36
performed 3
abandoned 4
developing 3
revived 3
plans 5
1606. 3
differences 5
offered 15
invited 10
buy 4
3.8m 3
net 21
tax 3
handed 19
cashier 2
orders 26
1,368,420.70 3
rate 3
2.13 1
thereafter 28
happy 1
sign 12
prepared 14
authorising 4
293,555.99 1
cooled 1
25 15
instituted 9
lent 3
admitted 12
receiving 7
unenforceable 7
lenders 1
ordinance 3
recover 14
year 12
instituting 1
inextricably 1
linked 2
1981. 2
komala 3
deccoff 2
import 3
export 1
owned 7
reversed 4
862/98 1
1,368,420.71 1
642,541.04 1
close 21
strike 9
19 14
inherent 5
barred 7
consequence 7
163 4
proprietary 6
chambers 3
proposed 29
13a 2
became 28
mistake 47
striking 4
wider 11
privy 17
yat 11
tung 11
dao 8
heng 11
bank 49
1975 11
581. 2
causes 4
deficiency 2
defect 1
therein 16
cured 1
prefer 2
drastic 2
soo 1
david 3
wee 7
satku 1
kumar 2
1994 44
481 1
karthigesu 2
487 1
noted 23
discretionary 2
permits 2
ko 1
teck 4
siang 1
mei 1
1992 17
454 1
sparingly 1
manuel 1
misa 1
raikes 1
currie 1
grenfell 1
gly 1
1876 1
app 8
cas 1
554 1
559 1
require 13
plead 1
want 16
fatal 7
amendments 12
consist 2
insertion 1
paragraphs 4
4141 2
thereon 8
disputing 2
maintained 6
acting 11
madam 10
instalments 10
bangkok 1
drafts 1
totalling 3
apparent 11
13 33
determining 18
4149 2
contrary 11
decoff 1
defendant 56
refund 8
continuing 3
serious 15
introduce 2
current 1
writ 7
expired 4
assumption 9
time-barred 5
overcoming 1
consequences 3
thrust 1
discovered 17
diligence 8
ambit 5
mistaken 7
ownership 3
ves 3
sen 3
126 1
934 1
accrued 1
recent 5
kleinwort 2
benson 2
lincoln 1
city 16
513 1
1095 1
abrogated 1
long-established 1
local 14
swap 3
hazell 1
hammersmith 1
fulham 1
london 4
borough 4
departed 2
judicial 11
recipient 4
honest 1
belief 12
entitlement 2
retain 2
discovery 4
occurs 1
existing 12
changed 8
reverting 8
inquire 17
truth 8
burden 9
payer 2
prove 6
caused 26
proceeded 15
began 3
recovery 4
moneys 12
determined 19
arguable 3
ignorance 3
beneficiary 12
trustee 10
proceeds 8
converted 3
primarily 4
chase 3
manhattan 3
na 2
israel-british 1
ch 10
105. 1
1974 4
o2m 1
twice 4
soon 9
liquidation 2
trace 2
equity 10
goulding 3
conflict 16
york 2
trustees 13
fiduciary 2
sinclair 3
brougham 3
1914 3
398 2
119 1
retains 2
conscience 5
subjected 3
am 19
fortified 2
my 104
speech 7
viscount 4
haldane 3
lc 8
419 2
420 1
unlike 2
lord 36
dunedin 1
suspected 1
heresy 1
diplock 3
spoke 11
atkinson 1
includes 2
421 1
auxiliary 1
tracing 1
wherever 2
belong 1
exception 22
westdeutsche 1
landesbank 1
girozentrale 1
islington 1
669 1
browne-wilkinson 3
disapprove 1
arrived 15
j. 3
browne- 1
wilkinson 1
715 1
rightly 6
irrelevant 5
foundation 2
snell 1
193 2
pettit 1
7th 1
168 2
metall 1
und 1
rohstoff 1
ag 2
lufkin 1
jenrette 1
391 1
473-474 1
learns 1
impressed 2
unjustly 3
enriched 1
restore 1
monies 1
716 1
unsuitable 1
remedial 3
satisfactory 9
forward 16
knowingly 1
deprived 7
tailored 1
innocent 4
restitutionary 1
change 11
united 8
canada 1
future 7
directly 7
refrain 1
expressing 1
apart 21
adduced 14
pursuing 2
581 5
mortgagor 1
defaulted 2
mortgagee 1
nullity 1
counterclaimed 4
loss 30
purchaser 6
fraudulent 1
kilbrandon 2
board 56
pp 35
589-591 1
depends 4
estoppel 15
lordships 5
mcmullin 1
narrower 2
discerned 1
series 3
969 1
formal 14
repudiation 5
pleas 1
534. 1
choi 1
kee 1
534 1
969. 1
litigated 5
locus 8
classicus 3
wigram 5
v-c 4
henderson 16
1843 3
hare 3
100 6
115 2
says 5
requires 6
contest 2
inadvertence 2
accident 2
omitted 5
plea 4
actually 9
pronounce 2
belonged 5
time. 1
shutting 1
scrupulous 1
limited 11
moreover 3
suffice 5
reserved 5
non-application 1
greenhalgh 2
mallard 2
1947 2
255 2
257 1
somervell 2
confined 4
covers 2
proceeding 11
started 18
540 1
endorsed 5
brisbane 1
a-g 3
queensland 3
developer 4
centres 3
attorney 3
valid 17
park 22
recreation 1
wilberforce 3
425 2
invoke 5
shut 2
classic 1
vc 3
hoystead 1
commissioner 3
taxation 1
1926 2
155. 1
proceedings. 2
590 3
previously 5
endorse 1
danger 1
genuine 1
helpful 4
hackney 2
789. 1
syndrome 1
girl 1
lived 1
mother 11
tenant 2
recurrent 1
bouts 1
chest 3
respiratory 1
infections 1
aggravated 1
disrepair 1
dampness 1
disposed 2
repair 2
stepfather 1
friend 9
statutory 17
assessed 2
allowing 4
plainly 6
household 4
multiplicity 1
dependent 2
child 2
merely 16
conveniently 4
unlitigated 2
monetary 2
bar 9
simon 4
brown 2
saville 1
butler- 1
sloss 1
ljj 2
794 1
reality 3
represents 4
significant 15
departure 6
successors 1
vulnerable 2
sir 13
james 7
understood 6
convoluted 1
sound 2
interested 8
formally 3
headnote 1
spencer 3
williams 4
1871 1
230 1
litigate 2
afterwards 4
reopen 1
identical 3
party. 1
black 5
yates 1
526. 2
reject 3
justifies 2
talbot 1
berkshire 1
county 3
290 1
bradford 6
bingley 2
society 25
seddon 7
hancock 9
1482. 1
fund 1
accountant 1
indemnity 3
enforce 4
owed 20
o180,000 1
walsh 1
rhodes 1
indemnify 1
misrepresentation 9
inconsistency 1
ward 2
nourse 1
concurred 1
referring 8
1490 1
important 19
qualifying 1
distinction 12
blurring 1
absolute 4
relitigation 1
test 25
task 3
draw 8
competing 3
hounded 1
history 8
1491 1
species 1
modern 2
reasonably 15
practicable 1
invoked 4
pursued 3
differed 1
1492 1
-litigation 3
maintenance 4
conflicts 1
rigidity 1
concept 19
element 7
collateral 12
attack 5
dishonesty 2
successive 1
unjust 4
harassment 1
narrow 1
onus 1
alleging 8
references 13
justify 12
litigating 1
occasion 9
obstacle 1
construe 1
developed 6
look 20
restrictive 1
cautious 1
barring 1
access 1
1498 1
treating 2
secure 7
admission 7
wasteful 1
encumber 1
necessity 4
emerged 3
proved 9
requiring 2
possible 21
initiated 2
purely 8
gleeson 1
wippell 4
1977 3
510 1
instructive 3
owner 2
collar-attached 1
shirt 6
clergy 1
1970 4
infringement 13
drawings 6
essence 4
copied 3
supplied 5
w 60
indirectly 3
infringed 4
copying 2
manufactured 10
upheld 5
delivery 13
infringing 3
copies 13
infringe 4
already 16
rejecting 2
megarry 1
join 8
ltd. 11
517-518 1
skone 4
centred 1
combination 3
rsc 1
denne 1
heart 1
core 1
joined 7
advance 3
sufficient 40
founded 5
great 19
difference 14
adding 2
contentions 2
me 136
considerable 7
chain 7
riches 1
emerges 1
bite 1
cherry 1
cross-examination 7
especially 4
yet 14
succeeds 2
hunter 17
manufacturing 3
soundtex 16
switchgear 2
80/1999 1
yim 1
kelvin 1
patrick 1
kl 16
assocs 1
80/99 4
82/99 4
jim 1
corrine 1
allen 1
gledhill 1
successful 6
designs 1
design 26
prayer 1
address 40
proprietors 3
inquiry 57
committed 17
seeks 2
oath 2
destruction 5
products 70
goods 49
documents 34
articles 6
materials 9
continued 23
offend 1
submits 11
punish 1
infringer 1
protection 10
russell 2
mengenthaler 1
linotype 1
intertype 1
43 2
rpc 10
381 2
382. 1
obey 1
still 33
boxes 5
possession 28
custody 1
control 7
beyond 17
complying 2
changes 4
break 4
parts 12
off 53
occasioned 4
abb 7
co-plaintiff 1
joinder 2
abandonment 1
none 11
kitnasamy 2
s/o 6
marudapan 2
nagatheran 3
manogar 4
16 16
13/2000 1
sarbjit 1
leong 4
kit 1
wan 124
ganeshamoorthy 1
jayapalan 1
ganesha 1
injunctions 3
convenience 2
processes 1
216 23
particulars 6
identify 8
oppression 5
standi 5
register 9
petition 6
oppose 1
participate 5
management 9
expedited 1
restrain 22
extraordinary 1
egm 9
remove 12
jasp 1
nagan 21
friends 6
apparently 10
supplier 3
sivaprakasam 1
petha 1
perumal 1
siva 16
uncle 4
piling 2
experienced 2
track 7
laying 9
phase 2
mrt 3
contacts 2
1998/january 1
approached 5
north- 1
east 3
consisting 2
tekken 5
corporation 8
hereinafter 6
tus 13
contacted 2
brother-in-law 1
guna 5
brother 8
dave 2
cotterell 6
office 20
familiar 4
senior 2
suppliers 2
sub-contract 2
vehicle 5
basically 3
dormant 1
100,000 2
paid-up 2
33,333 2
one-third 4
understand 5
transferred 19
state 42
search 35
registry 6
99,999 1
rk 1
auditor 3
subramaniam 2
told 87
update 2
records 5
annual 15
returns 3
safe-keeping 1
quotation 2
sub-contractor 1
intent 3
details 2
undertaken 2
everything 3
meantime 6
inject 4
recruit 1
helping 1
projects 3
idea 5
providing 4
commence 1
managed 7
convince 1
advantage 7
restaurant 1
n 3
kinian 11
sourcing 3
rails 2
estag 6
aviation 2
field 2
42 11
possess 1
rail 3
malaysia 32
cheaply 1
savings 1
equipment 6
recruited 2
thanikumaran 2
help 8
business 95
minority 3
beneficial 2
secured 3
printed 2
calling 10
cards 3
commission 6
supplying 2
declined 2
regarding 6
distribution 93
keen 1
drawing 4
concern 6
funds 32
financial 18
securing 3
insurance 2
bonds 7
5,000 3
foreign 4
worker 2
heavy 5
estimated 1
184 1
workers 6
400 2
risk 7
reimburse 1
anxious 1
earned 1
distributed 4
shareholders 44
christmas/new 1
festivities 1
contact 3
messages 1
left 28
calls 5
ignored 3
post 4
considering 12
intimated 2
wished 8
instrumental 1
effort 3
entertainment 1
jeopardised 1
monitor 1
agency 4
attempting 2
oppressive 4
os 6
57/2000 1
realised 6
majority 3
shareholding 22
parte 18
2000. 1
fraud 37
running 6
private 9
legitimate 6
grievance 2
via 4
summons 9
summons-in-chambers 3
proof 9
removal 4
pleading 4
refuse 4
specific 19
allegations 13
216. 1
headings 1
chapter 2
statutes 2
edition 2
november. 1
founding 1
furnished 6
holder 4
debenture 2
ix 2
affairs 7
conducted 13
directors 22
holders 4
debentures 4
disregard 4
threatened 5
class 4
discriminates 2
applicant 13
rely 16
malaysian 20
owen 3
sim 7
liang 3
khui 2
piasau 2
jaya 5
sdn 5
bhd 6
discrimination 1
complained 19
conclusive 1
updated 1
federal 1
181 3
1965 2
precluding 1
petitioner 5
requirement 25
demonstrate 2
presentation 3
universal 3
instances 7
inequitable 4
assert 4
estopped 11
asserting 6
guilty 12
unconscionable 11
defeat 4
standing 7
using 16
instrument 4
gopal 1
sri 1
ram 1
jca 1
134 1
transpires 1
leading 7
complainant 15
lacked 1
examples 3
multiplied 1
emerging 1
governs 1
housed 1
preclude 1
litigant 1
answer 15
seemed 9
invaluable 1
responsible 3
administration 59
reinforced 2
proxy 1
despatched 3
gist 3
complaint 118
evidenced 4
arrangement 5
partnership 8
cite 2
profits 14
relatives 1
intentions 1
maximise 1
causing 10
tender 3
resignation 1
henceforth 2
entity 2
personality 2
ebrahimi 1
westbourne 1
galleries 1
360 3
379 1
room 20
recognition 2
behind 11
individuals 5
expectations 3
submerged 2
structure 6
considerations 7
personal 21
character 14
insist 6
bok 3
choon 4
tahansan 1
1987 11
433 1
posgate 1
denby 1
agencies 1
bclc 1
hoffman 1
ringtower 1
holdings 135
plc 1
bcc 1
90 5
gibson 1
exclusion 2
tullio 2
maoro 2
489 1
expended 1
fulfil 7
bargain 4
presented 5
warranting 2
non-involvement 1
teo 2
mong 1
frank 13
wilh 1
schulz 1
gmbh 1
529 2
restraining 12
removing 2
tiang 7
hin 8
jerry 22
medical 43
144/1999 1
engelin 4
juliana 1
philip 1
chang 30
man 16
phing 1
chua 19
sui 1
tong 3
harry 4
elias 4
unreasonableness 2
irrationality 2
proportionality 8
complaints 131
irrational 7
disproportionate 4
appointing 7
irregularity 7
nullify 1
registration 9
174 7
40 29
audi 4
alteram 4
partem 4
advertising 61
promotion 44
allegation 15
framed 10
nemo 2
judex 2
causa 2
sua 2
composition 2
bias 11
suspicion 9
apprehension 2
certiorari 10
smc 54
dr 197
quash 7
prohibition 7
prohibiting 3
touching 2
ophthalmologist 7
practitioner 12
mra 34
owns 5
runs 1
clinic 37
eye 27
surgery 2
gleneagles 1
times 18
excimer 3
specialist 25
eyecare 27
optical 38
shop 76
located 4
mall 1
kim 6
seng 38
carries 1
spectacles 1
lenses 1
francis 2
ophthalmology 1
daniel 3
licence 33
title 9
opens 3
interview 3
alluded 2
licensed 5
roof 1
cheong 34
pak 1
yean 1
sma 5
detail 5
shortly 8
poi 1
kwong 4
submit 4
explanation 23
accompanying 1
enclosures 3
denying 4
etc 3
seven 3
messrs 1
enclosing 1
whilst 9
licensee 4
num 14
01-38a 2
promenade 5
237994 5
01-38 3
retail 12
eyewear 3
profit 19
expense 5
colleagues 3
wit 4
pore 2
laudatory 1
infamous 3
profession 8
disrepute 2
flurry 1
queries 1
answers 5
brings 3
raises 3
six 12
seriatim 1
information 33
inquiring 7
compromised 3
independence 4
expected 9
potential 8
patients 6
forms 5
demarcates 1
boundaries 1
amounted 8
ventured 1
extraneous 5
resulted 7
framing 5
charge 54
confer 6
obliges 2
focus 2
restrained 6
fettered 1
ethical 18
code 34
examine 7
axiomatic 1
exactly 4
unhappy 4
most 13
impressions 6
incumbent 4
ascertain 2
reckons 1
ultimate 2
lies 5
naturally 1
strayed 2
nullified 1
pharmaceutical 2
chemists 2
pharmacies 2
doctor 10
directing 4
patient 3
chemist 1
opticians 2
turns 4
nric 4
1234118/j 1
annexed 3
confirmed 11
businesses 11
rcb 5
operates 3
checking 3
retrieved 1
ascertained 3
tiers 1
shareholdings 8
goh 21
suan 1
choo 6
1/3 4
summary 16
results 3
capitol 1
engaged 6
enterprise 2
compromise 1
particularised 1
iv 10
professions 1
grave 18
practising 1
door 18
display 1
logo 4
practitioners 4
exerting 1
undue 3
influence 2
transactions 2
discreditable 2
incompatible 2
detracts 1
medicine 3
attempts 6
canvassing 3
touting 3
patients. 1
newspaper 2
annex 1
besides 5
retailing 2
roof. 1
shops 8
eyesight 3
correction 1
problems 13
cataracts 1
mega 1
store 6
one-stop 1
links 1
physical 2
proximity 1
sic 18
constitutes 7
investigate 5
paragraph 11
uncertain 1
rest 5
body 13
devoted 2
detailing 1
link 4
penultimate 1
reiterates 1
possibility 4
source 4
bolster 1
argues 2
refers 7
invitation 3
cover 6
enclosed 7
audit 2
accreditation 2
unit 11
ministry 5
health 4
crux 3
relevance 7
fortuitous 1
precisely 3
complaining 3
distinguished 5
seah 4
pong 2
tshai 2
399 1
difficult 15
solicitor 7
overcharged 4
returned 13
1,000 9
cheating 1
lawyer 5
ang 4
beng 25
kheng 1
ic 1
1410117/i 1
sincerely 1
pt 1
petros 1
lek 1
morning 7
appearance 3
trickery 2
fill 2
entries 1
signature 2
write 2
top 9
accepting 5
extra 16
4,000 2
whereas 4
2,000 1
overcharging 1
wanted 22
hard-earned 2
deducting 1
cost 7
1987. 1
forfeit 1
initial 6
attending 1
vain 1
consulted 3
falsely 7
denied 24
gravity 6
80 4
161 3
lpa 3
judges 4
gravamen 2
402 1
evident 1
guru 1
settle 6
admit 4
incidental 3
ratnam 2
405 1
inquired 2
1988 4
chief 35
appoint 10
else 11
investigating 9
unquestionably 1
nisi 1
discharged 7
education 13
1910 1
kb 3
165. 1
swansea 1
categories 2
schools 13
non-provided 5
increase 10
salaries 7
teachers 9
oxford 4
street 9
school 29
1902 1
barrister 1
hamilton 3
kc 1
efficient 4
managers 4
higher 5
maintain 10
inadequate 4
maintaining 3
keeping 4
mandamus 1
divisional 13
discriminate 2
complainants 3
treatment 2
non-exercise 1
entrusted 2
cozens-hardy 1
174-175 1
answered 5
paras 3
1908. 1
earn 1
battle 1
raged 1
ever 7
scintilla 1
conveying 1
purport 2
repudiate 1
suggestion 5
wholly 14
throw 2
procured 2
lead 5
explain 9
invokes 1
cardinal 1
condemned 1
reflected 3
deliver 5
inviting 3
offer 10
allegedly 6
advertised 2
acquiescing 1
preferring 1
major 5
live 3
suggestions 1
reading 3
lengthy 1
consists 4
answering 1
touched 2
looking 7
maradana 1
mosque 3
badiuddin 1
mahmud 1
1967 1
zahira 1
college 1
unaided 4
assisted 1
training 1
colleges 1
ceylon 2
corporate 2
proprietor 3
k 8
satisfy 3
administered 2
declare 2
cease 11
unpaid 2
manage 4
institution 2
assured 4
director-management 1
11. 1
violated 1
pointed 13
quashed 4
pearce 1
23-25 1
warning 9
1961 2
recommend 1
1961. 1
promise 3
behaviour 6
far-reaching 1
imputed 1
played 3
lordship 2
paper 15
influenced 3
assume 6
tendered 3
hardly 2
launched 3
fresh 13
fairmount 6
environment 2
865 1
1255 1
showing 8
proposal 6
compulsorily 1
houses 5
unfitness 2
emphasised 1
foundations 6
inspector 9
visited 2
defective 1
compulsory 3
purchasing 1
refuting 2
observation 6
repaired 1
dilhorne 1
1260 1
twofold 2
holes 1
bored 1
rehabilitation 3
financially 1
viable 2
inadequacy 3
attached 2
weight 11
formed 8
objector 1
confirm 4
erroneous 5
deep 4
impractical 1
killowen 1
1265 1
consonant 1
fairness 4
uphold 1
generalise 1
outlined 1
derivation 1
crack 1
whip 1
sheared 1
tell-tale 3
anticipated 1
progressive 1
old 6
suppose 1
paddington 1
rent 1
supposed 3
landlord 2
ceilings 1
eight 3
feet 1
anticipating 1
inference 17
drawn 16
shearing 1
persuade 1
surprise 3
relevantly 1
conclusions 2
h 1
sabey 1
1978 3
586. 1
planning 1
extraction 11
sand 1
gravel 3
reduce 1
agricultural 4
quality 10
productivity 1
agriculture 1
replacement 3
moisture 4
yield 1
willis 2
alerted 1
call 56
base 3
214 1
blame 4
feeling 2
afforded 2
reaches 1
detailed 8
remind 1
ourselves 2
glaisdale 1
similar 20
enquiry 1
exculpates 1
88 3
small 5
penalty 3
89. 1
misled 2
putting 2
forthwith 5
chronology 1
complied 7
expiry 1
notifying 5
notify 8
prescribe 5
livelihood 1
stake 1
construed 8
factually 1
unsustainable 2
literal 1
minimum 5
maximum 5
safeguards 3
relies 4
bridge 3
harwich 2
mcmahon 2
625 2
702-703 2
t 7
conferred 6
affecting 5
readily 2
majlis 2
peguam 2
au 1
weng 1
57 9
evidential 1
unsigned 1
carried 19
minute 2
produced 15
explained 15
expunged 1
blanked 1
accounted 2
blank 11
spaces 1
appearing 2
deliberation 3
thirdly 4
compliance 6
implies 1
disadvantage 5
preceding 4
so-called 1
engraved 1
tablets 1
stone 1
expresses 1
demand 11
domestic 1
decision-making 1
framework 2
unfairness 2
injustice 1
safeguard 5
lawyers 2
mismanagement 1
penang 3
recommendation 1
weeks 5
recommendations 1
turned 10
legislation 5
non-compliance 3
thereunder 4
incurably 1
comply 5
lag 1
acknowledged 2
regulations 10
invalidates 1
nine 11
sending 2
named 6
vacancy 2
naming 3
attempted 4
unsupportable 1
spurious 1
appointees 1
filling 1
immediate 4
nullifying 3
coney 1
choyce 1
979. 1
proposals 7
reorganisation 1
roman 1
catholic 1
towns 1
publicity 7
governors 12
requisite 4
1944 1
country 5
voluntary 1
1968. 1
circulated 1
objections 1
approve 2
parents 1
children 4
invalid 8
templeman 3
directory 3
988-989 1
de 8
smith 3
3rd 3
formulate 1
criteria 5
disobedience 3
voidable 1
validity 8
deviation 1
excused 1
often 1
stressed 1
impracticability 1
specifying 2
exact 3
assignment 1
category 4
enactment 3
disregarded 2
intended 24
nullification 1
trivial 1
inconvenience 1
disinclined 1
impugned 2
specify 1
apt 3
insistence 2
dire 1
bare 1
assertion 12
stain 2
exaggerated 2
contrast 3
constable 6
merseyside 1
police 29
calveley 1
424 1
protracted 1
officers 27
nearly 2
half 7
irremediably 1
logs 1
incident 11
routinely 2
destroyed 5
retire 1
premature 4
pending 9
quashing 2
exceptional 2
three-year 1
investigations 3
investigated 2
439 1
effective 10
swift 1
particularly 4
unnecessary 6
analogous 2
deplored 1
occur 3
mala 2
fides 8
tempt 1
resort 2
witnesses 19
439-440 1
reg 2
timeously 1
radio 1
log 2
sheets 2
parade 2
suspect 1
49 8
1964 2
warned 1
1983. 1
respectfully 2
sergeant 1
ashton 1
appellate 7
garner 1
disproportionality 1
lastly 3
offence 18
instead 14
premise 3
opined 4
lacking 3
conclude 2
characterise 1
prosecutor 19
comprises 2
casting 1
vote 1
maker 2
minded 1
sitting 2
cites 1
committees 5
observer 1
make-up 1
play 2
souza 1
lionel 2
jerome 1
biased 1
prejudged 1
guilt 4
defending 5
cross-examine 4
prosecution 49
truthful 3
teong 2
qwee 3
jc 11
kalpanath 1
639 1
impartiality 1
conversations 1
advised 9
tell 4
believe 7
unprejudiced 1
176 1
over- 2
prescribing 1
drugs 35
associated 8
incidents 2
tribunals 1
hannam 4
690 2
pinpoint 1
schoolmaster 1
sub-committee 7
prohibit 3
sub- 3
resolved 8
donning 1
hats 1
attend 1
built-in 1
tendency 1
sit 2
overturn 1
placing 5
outside 16
impugning 1
unsuccessful 2
elgindata 1
232 1
489. 1
thirds 1
national 7
aerated 4
water 16
monarch 78
445/2000 2
vinodh 2
coomaraswamy 3
shook 2
lin 2
howard 2
cashin 2
khoon 2
hua 2
bottle 14
trademark 28
beverage 79
restraint 60
confining 1
duration 4
licensing 4
enforcement 2
reasonability 1
freedom 10
excludes 1
severance 14
altered 4
proven 6
marks 4
confirming 3
america 5
trademarks 5
kickapoo 23
joy 24
juice 25
non-alcoholic 1
beverages 3
nawc 142
licensee.lawyers 1
1966 48
kjj 7
canadian 2
producing 4
selling 23
carbonated 5
drinks 5
produce 16
distribute 10
bottled 8
sister 9
bottles 21
founder 1
yew 3
cky 5
assigned 5
clauses 1
bottler 23
concentrate 7
elected 4
cans 21
distinctive 10
crowns 6
bottling 7
prepare 1
quantities 2
continuously 3
efficiently 3
territory 3
product 18
life 11
keep 11
handle 3
restricted 3
8. 2
examined 6
operate 6
plant 3
plants 3
size 3
trucks 3
vigorously 2
sanitary 1
healthful 1
attractive 2
failures 2
begun 1
delete 3
partof 1
privileges 2
obliterate 1
buildings 1
obliteration 1
removals 1
dispose 5
belonging 5
predecessor 4
permission 8
plastic 125
polythene 1
pet 22
canning 8
malacca 1
economic 1
canned 17
transported 1
deterioration 1
onwards 1
sales 38
wherein 3
corrective 1
referenced 1
employ 1
indicative 2
assurances 1
remained 9
unfulfilled 1
pepsi 1
cola 1
market 17
mountain 1
dew 1
urgent 2
franchisee 2
non-returnable 1
covering 3
overlapping 2
concentrates 10
desist 1
returnable 1
survey 5
packed 1
fast 1
diminishing 1
packaging 8
reminded 2
acquiescence 2
1994. 5
crest 2
trading 17
continue 11
provisional 1
receive 4
stopped 9
poor 4
threat 2
franchise 2
successfully 3
promoted 1
purported 15
1996. 7
distributing 4
kick 14
invoice 4
guan 4
drew 11
napier 9
instanter 2
aerated/singapore 1
imitation 6
substitute 3
contains 4
waiving 1
mitigate 1
negotiated 2
royal 5
crown 1
rcc 3
soft 6
drink 7
1964. 1
purportedly 4
trying 5
utilise 2
mark 19
invoices 4
1.25 1
litre 1
deceived 3
labelling 1
believing 2
passing-off 13
injunctive 4
exploiting 1
argue 7
illegal 5
oral 27
logical 5
expansion 1
abreast 1
technological 2
advances 2
stood 8
impliedly 2
balancing 1
interference 4
restrict 7
symbol 1
confusion 16
competition 6
free 4
altogether 5
disposing 1
stocks 18
calculated 2
deceive 2
mislead 1
tort 12
enforceability 1
entitling 1
illegality 4
unenforceability 2
declaring 1
relying 5
north 1
western 2
salt 1
electrolytic 1
alkali 1
461 1
469 3
completely 4
warn 1
rebutting 1
presumption 2
isolated 1
easily 3
miscarriage 1
rests 1
irrespective 2
descriptive 46
designation 4
syllable 8
cancelled 1
cancellation 1
mailed 1
mail 2
older 2
apprentice 1
craftsman 1
compete 2
leaving 11
trader 2
bounds 1
mcellistrim 1
ballymacelligott 1
co-operative 1
dairy 2
1919 1
548 1
prevented 4
milk 6
kerry 1
assumed 5
esso 4
harper 1
garage 1
stourport 1
1968 2
petrol 3
garages 1
inasmuch 1
brands 3
define 3
nordenfelt 2
maxim 1
guns 1
ammunition 1
1894 1
535 1
565 1
macnaghten 2
restraints 1
exceptions 3
petrofina 1
britain 1
martin 13
146 1
180 1
covenantor 1
agrees 1
covenantee 3
chooses 1
337 1
reviewing 2
categorised 3
closed 4
stipulated 1
schroeder 1
music 1
publishing 2
macaulay 1
616 1
1308. 1
reasonableness 3
goes 4
affording 1
excluded 2
recognise 3
manufacture 4
convenantee 1
morris 2
saxelby 1
1916 2
688. 1
illustration 2
hawkesbury 1
bakery 1
pty 4
moses 1
nswr 1
1242 1
baker 1
possessed 1
goodwill 29
limb 2
contain 12
syllables 2
ka 1
distinctiveness 6
inventions 1
substitutes 1
indicia 3
incorporate 1
troubles 1
mid-eighties 1
predecessors 1
disclaim 1
exclusive 5
disclaimer 1
orange 1
squash 3
seeing 5
confuse 1
concentrated 2
production 6
covenant 10
viewing 2
extravagant 1
fanciful 8
contemplated 6
remains 5
unlikely 1
contemplation 2
counties 2
dairies 1
skilton 1
1227 1
diary 1
conceivable 1
haynes 1
doman 1
1899 2
attained 1
rivalry 1
covered 4
rational 1
purposively 2
ignore 1
re-write 1
protected 4
offending 1
severed 3
cut 6
objectionable 4
classical 1
example 2
easy 3
reconcile 1
illustrate 2
attwood 8
lamont 2
1920 1
571 1
draper 2
tailor 3
outfitter 2
kidderminster 2
organised 3
x 2
headcutter 1
tailoring 2
anybody 3
trades 3
dressmaker 1
milliner 1
hatter 1
haberdasher 1
gentleman 1
ladies 2
miles 2
divisions 1
blue 4
pencil 2
altering 1
disagreed 1
younger 2
593 1
covenants 1
unaltered 1
goldsoll 5
goldman 2
1915 1
292 4
jewellery 5
kingdom 2
france 1
usa 1
russia 1
spain 1
potsdammerstrasse 1
berlin 1
st 1
stefans 1
kirche 1
vienna 1
respects 4
arguably 1
territorial 1
authors 5
cheshire 1
fifoot 1
furmston 1
12th 1
differentiate 3
divisible 1
promises 2
elimination 1
unchanged 1
basic 2
divisibility 1
enumeration 1
laborious 1
description 5
indivisible 1
drafted 1
needs 2
force 8
tangible 1
conceded 5
disputed 6
consisted 6
get-ups 1
beside 3
disagreement 3
recalled 7
30-day 1
notice. 1
assuming 4
affirm 2
spite 2
repudiatory 3
17. 1
effected 5
continuation 2
licences 11
variations 2
vice 2
variation 11
recognising 3
container 5
inconceivable 5
terminable 1
injected 2
status 1
expansions 1
contracting 2
stutz 2
testify 2
generally 9
evidence-in- 1
ironically 1
vis-ã 1
-vis 1
retracted 1
admitting 1
glass 4
testified 5
first-hand 1
q 25
disagree 2
vogue 1
yes 7
acquiesce 1
helped 1
machinery 2
improbable 1
inclined 3
creating 5
varied 9
technically 2
demonstrates 1
hereto 3
modified 1
bottlor 1
duly 7
vice-presidents 1
militate 1
waived 1
waiver 2
disturb 2
types 3
infringements 1
stop 3
stock 13
twenty 2
closing 1
servants 1
agents 2
howsoever 1
offering 1
encompass 2
italicised 2
deleted 2
chan 11
chim 3
yee 6
cr 8
29/1999 1
lai 5
kew 5
franxis 1
xavier 1
quek 1
bee 8
winston 1
cheng 11
howe 1
deputy 3
criminal 82
murder 10
identification 11
' 6
safe 1
diminished 4
responsibility 8
convicted 10
7.30pm 3
car 38
block 58
1002 6
jalan 24
bukit 27
merah 24
redhill 10
death 36
ooi 1
yen 2
300 7
punishable 3
302 1
penal 9
224 8
sentenced 4
suffer 4
conviction 11
married 1
son 13
aged 2
cleaner 12
image 4
printers 1
04-12. 1
1995. 4
trip 2
china 1
neighbour 1
elderly 1
lady 1
liaison 1
colleague 2
hon 3
workplace 8
lunch 5
che 1
noi 3
missed 3
confronted 2
dinner 4
hit 9
head 14
assault 1
evening 14
floor 43
ah 138
nai 2
cheah 18
feb 73
choy 1
keng 2
walked 27
stairs 4
onto 5
driveway 1
heading 3
towards 19
footpath 2
leads 2
1003 3
altercation 2
stabbed 4
knife 11
fled 4
dead 3
ambulance 1
stab 4
wound 4
anterior 2
lower 5
neck 14
penetrated 2
cm 16
nipple 1
lesser 1
injuries 14
pathologist 3
paul 2
chui 1
wounds 6
assailant 11
factory 11
canteen 1
walking 7
near 19
8am 4
smiled 1
someone 15
approaching 2
saw 62
distance 4
metres 4
sure 5
walk 1
gate 9
conversing 1
cantonese 1
conversation 8
boyfriend 3
nearing 1
assaulting 3
fisting 1
slapping 1
yellow 3
bag 105
stabbing 1
few 12
cid 3
assaulted 3
occasions 5
lunchtime 1
fateful 3
male 17
chinese 18
rear 3
stepped 1
across 3
voice 7
loud 1
angry 11
tone 2
groaning 1
pain 1
dark 3
night 16
frightened 4
worked 11
5pm 9
adeline 10
chay 8
kin 4
firm 5
regency 1
asia 9
cleaning 12
interviewed 3
starting 5
shift 7
daily 8
attendance 8
signing 6
supervisor 7
kang 6
herself 3
usually 5
supervised 1
reporting 7
page 1
hotline 1
message 4
acceded 1
7.30am 2
presence 9
5.17pm 3
pager 2
paged 1
blk 12
211 1
5.20pm 1
breaks 2
errant 1
deduct 2
wages 1
hours 4
overtime 1
6pm 2
9pm 3
10- 1
living 7
11pm 1
midnight 4
3am 1
alibi 4
suffering 2
abnormality 2
impaired 3
mental 4
flatly 1
anywhere 1
telephoned 1
inform 6
guard 8
william 2
wilson 2
pau 1
bun 2
ate 1
collected 1
toilet 15
key 6
raju 4
7.15pm 1
lift 26
8pm 5
storey 4
chatted 1
guards 1
bathe 1
bath 1
downstairs 2
talked 1
malay 3
staying 3
fire 1
sleep 2
piece 9
cardboard 2
staircase 6
landing 13
7pm 2
hawker 1
central 4
woman 6
murdered 2
photograph 2
girlfriend 11
happened 4
sailor 1
killed 2
cried 1
afraid 2
stayed 7
reciprocate 1
tiong 10
bahru 9
clerk 1
plaza 8
movie 1
chided 1
getting 3
mahmood 6
bin 12
osman 3
rounds 1
4am 1
sleeping 2
vincent 1
chun 2
keong 1
remember 6
backward 1
glance 2
difficulty 5
veracity 1
disapproved 1
romantically 1
poorly 1
lit 2
lamps 1
stretch 2
positive 3
attacked 4
remembered 3
distress 3
affection 1
vent 1
animosity 3
patently 1
unreliable 1
disproved 1
32 17
believed 2
false 1
corroborated 1
contemporaneous 1
reliable 1
duty-bound 1
th 1
7and 1
inflict 2
bodily 1
injury 10
douglas 1
consultant 2
psychiatrist 1
elder 1
psychometric 1
assessment 4
weschler 1
adult 1
intelligence 5
scale 6
wais 1
graham-kendall 1
memory 4
mfd 1
borderline 1
maladaptive 2
coping 1
stress 5
impulse 1
psychiatric 1
suspicious 1
paranoid 3
disorder 1
emotional 3
stressful 5
grief 1
reaction 3
contributed 3
remorse 2
rationalisation 1
bland 1
emotionless 1
incongruent 1
psychosis 2
dissociative 14
fugue 17
customary 3
inability 5
recall 6
pre-fugue 1
conform 1
hypothesized 1
amnesia 7
disturbance 1
episodes 1
traumatic 1
extensive 5
forgetfulness 1
syndromes 1
psychological 1
depression 1
reactive 1
judging 1
unsure 1
deed 1
memories 3
scientific 5
self-esteem 1
happen 1
phenomenon 2
hysterical 5
confabulation 5
gospel 1
gwee 7
kok 5
rebuttal 2
associate 1
woodbridge 1
hospital 2
symptoms 2
indications 3
speaking 2
escapes 1
tends 1
wander 1
diagnosis 1
universally 1
study 1
debate 1
consensus 1
confabulations 2
meaning 36
dissociated 1
